{ "vbee_Authorization" : "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpYXQiOjE2NTgxMzMwMjl9.mXlTv4WfK9C1rUFcUUgxfx_1QYjZg7UHrhM0FpOeVkc", "vbee_app_id" : "985eefdc-3a15-4949-a803-8979172fc6ca", "vbee_callback_url" : "http://daotao.ai:8080/vbee/api", "vbee_voice_code" : "hn_male_manhdung_news_48k-fhg", "vbee_speed_rate" : 0.9, "scenario" : [{"presentation_action" : [{ "ActionGroup" : "#APP", "Action" : "Mở POWERPOINT", "ActionPara" : "D:\\working\\git\\AuthTool\\data\\Multicast\\Thiết kế mạng IP_Chương 4_Multicast.pptx", "Delay" : 2000}, { "ActionGroup" : "#KEY", "Action" : "PgDn", "ActionPara" : "", "Delay" : 200}, { "ActionGroup" : "#KEY", "Action" : "PgDn", "ActionPara" : "", "Delay" : 200}, { "ActionGroup" : "#KEY", "Action" : "Shift-F5", "ActionPara" : "", "Delay" : 2000}], "text" : "Ta đã quen thuộc với mô hình truyền tin unikesst, trong đó có một trạm truyền tin gửi đến một trạm nhận tin. Bài toán măltikesst, đặt ra trong các tình huống khi cùng một nội dung thông tin, cùng một thời điểm, mà một trạm truyền tin và nhiều trạm muốn nhận tin. Ví dụ phổ biến hiện nay như các buổi hội thảo tryền hình, các lớp học trực tuyến, hay hệ thống truyền hình Internet.", "audio_file" : "D:/test","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/357af8e5-56e2-44b8-bb27-5d2d5bcdb45d.mp3","vbee_request_id" : "6da916a5-16f6-4be2-b532-f42a368a314d"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Bây giờ, ta sẽ tìm hiểu sâu hơn quá trình truyền tin trong ví dụ lớp học trực tuyến. Máy tính của giáo viên, trong trường hợp này là trạm Host, lấy dữ liệu từ các thiết bị kết nối, như Camera và Microphone, để truyền đến máy tính của người học. Các dữ liệu Multimedia này được đóng gói và di chuyển trên đường truyền, từ Host, qua các Router trung gian, và đi đến trạm nhận.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659030919330.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/3f2a05bb-4b55-47ed-8ce0-b02c0a6ace3e.mp3","vbee_request_id" : "22cc2378-5915-4654-916b-3b83706ea6e3"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Xuất hiện người học thứ hai muốn tham gia vào lớp học. Khi đó, một dòng các gói tin Multimedia lại được tạo ra để di chuyển từ máy Host, đến máy số hai, đi qua các Router trung gian. Một cách ngẫu nhiên, tùy theo cấu trúc mạng lõi, kết nối các Router, mà dòng gói tin số một và dòng gói tin số hai, bị trùng nhau ở một số điểm trên đường truyền. Các điểm đó là các Router, và các đường kết nối giữa các Router này.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659025902798.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/7ae427c9-cf70-42a7-9e76-a7deea87d0eb.mp3","vbee_request_id" : "5d90204b-cfd5-48dc-b6dc-0e99dda0a4d1"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Tiếp tục xuất hiện người học thứ ba muốn tham gia vào lớp học. Lại một dòng gói tin Multimedia mới, được tạo ra để di chuyển từ máy Host đến máy số ba, và ngẫu nhiên lại trùng một phần với các dòng dữ liệu số một và số hai, đang di chuyển trong hệ thống.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659026151437.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/509c8376-d89d-4b70-a69b-a021e605c429.mp3","vbee_request_id" : "b3385881-9674-4e4b-88c4-7bde9b76ff5a"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Enter", "ActionPara" : "", "Delay" : 200}], "text" : "Việc trùng các dòng dữ liệu Multimedia trên các kênh truyền, và trên các Router như vậy, sẽ tạo ra hiện tượng quá tải mạng. Càng nhiều người học tham gia vào lớp học, việc quá tải trên đường truyền và Router càng trầm trọng. 
Điểm lưu ý ở đây, là các dòng dữ liệu đồng thời này, giống hệt nhau về nội dung, nên tạo ra tình huống lãng phí tài nguyên đường truyền. Hình dung nó giống như việc một nhân viên văn thư, cần gửi thông báo đến cho nhiều người, ở cùng một địa phương. Thay vì gửi một tờ thông báo đến địa phương đó, rồi Photocopy ra nhiều bản, cô ấy lại Photocopy ngay thành hàng nghìn bản, và thuê nhiều xe tải để chuyển số hàng nặng nề này, đến địa phương kia, và có thể là ở rất xa. Quả là một việc làm rất vô lý phải không?", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659026717311.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/8912475b-3139-4177-9068-038c0a879688.mp3","vbee_request_id" : "d5e48102-1068-4c4b-8fb9-6f8179b58924"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Bây giờ, ta sẽ xem kỹ thuật măltikesst, sẽ xử lý vấn đề lãng phí đường truyền này như thế nào. 
Xuất phát từ dòng gói tin Multimedia thứ nhất, các gói tin được các Router tìm đường theo địa chỉ trạm nhận, và được chuyển tiếp lần lượt qua các Router tiếp theo trên đường truyền, cho đến khi cập bến ở trạm nhận. 
Nếu là kỹ thuật chuyển tiếp gói tin unikesst, các Router hoạt động ở chế độ chuyển tiếp rồi quên, Forward And Forget. Tức là, các gói tin sau khi được tìm đường, và được chuyển tiếp sang Router tiếp theo, thì Router sẽ không còn nhớ gì đến dòng gói tin này nữa. Trong trường hợp măltikesst, Các Router phải ghi nhớ một số thông tin của từng dòng dữ liệu măltikesst này, để phục vụ cho các yêu cầu sẽ tiếp nhận về sau.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659027575494.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/580600fa-c3a9-4815-9909-1af1f3204137.mp3","vbee_request_id" : "d451dd2d-1430-4aef-ab78-5603c4e7eedd"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Quay trở lại lớp học trực tuyến, trong khi trạm Host đang truyền dòng Multimedia từ máy tính của giáo viên, đến máy tính người học thứ nhất. Xuất hiện người học thứ hai muốn tham gia lớp học. Bằng một cách nào đó, hệ thống xác định dòng gói tin Multimedia này có thể được trích ra từ một Router, có vị trí gần với trạm nhận thứ hai, mà đang tham gia vào phiên chuyển tiếp gói tin từ Host đến trạm nhận thứ nhất. Kết quả là, thay vì phải gửi các gói tin lặp lại từ trạm truyền gốc, dòng gói tin măltikesst được Router này nhân bản, và chuyển tiếp qua các Router trung gian để cập bến máy tính của người học thứ hai.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659028076153.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/d4e71f47-527b-4a26-97eb-b64b33348be8.mp3","vbee_request_id" : "0798b10d-cbd6-4151-accd-ac37a91ffe59"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Cũng như vậy, người học thứ ba muốn tham gia lớp học. Hệ thống lại tìm ra một Router gần với trạm nhận thứ ba, mà cũng đang tham gia vào phiên măltikest, để nhân bản dòng gói tin măltikest này và chuyển tiếp đến trạm nhận.
Kết quả là tất cả người học trong lớp đều nhận được đầy đủ dữ liệu gửi từ giáo viên, giống như trong phiên unikest. Nhưng điểm khác biệt là trên các đường truyền và Router trung gian, không xuất hiện tình trạng lặp các gói tin có nội dung giống nhau dẫn tới quá tải hệ thống.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659028456662.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/65108002-7643-4df9-9af7-5c29ac4515ae.mp3","vbee_request_id" : "98f60f0e-cf57-43fb-9ee9-a9160b09d2dd"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Giải pháp Măltikest mang đến cơ hội tuyệt vời để triển khai các ứng dụng Internet Multimedia hiệu quả. Ví dụ như truyền hình Internet xuất hiện, và đang dần loại bỏ các hệ thống truyền hình kỹ thuật cũ. Tuy nhiên, nó cũng tạo ra vấn đề an toàn thông tin mới, mà Unikest không có. Vùng Măltikest, hay còn gọi là cây Măltikest, được tạo nên bằng cách ghép nối các Router trong mỗi phiên Măltikest, phải được đảm bảo an toàn khỏi các truy nhập không được phép.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659028753443.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/a9405883-4995-4a71-bdbe-e6a95e5ab074.mp3","vbee_request_id" : "582f291a-d391-4e0c-86b8-de6c8a48558f"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Bạn hãy hình dung điều gì sẽ xảy ra nếu nguồn phát, hoặc Router cạnh nguồn phát, bị lộ thông tin địa chỉ. Hách-cơ có thể tấn công, hoặc đơn giản là chỉ gửi vào đó các thông tin thất thiệt. Nếu đó là Router đang tham gia vào phiên truyền hình của VTV1, một bản tin của hách-cơ có thể được phát tán đến toàn bộ người xem truyền hình Việt Nam, và nguy hiểm hơn nữa, là nó được phát đi trên kênh truyền hình chính thức quốc gia. Có nghĩa là một bản tin giả mạo được phát đi khắp đất nước, và người dân lại hoàn toàn yên tâm đó là tin chính thức của chính phủ.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659029274499.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/1004e54a-2344-4405-bcab-ed8ac5f00ed1.mp3","vbee_request_id" : "2824362b-0d9e-4d4f-a544-eeba0dd42441"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Lưu ý rằng, việc bảo vệ an toàn cho cây Măltikest, không chỉ phải được thực hiện ở nguồn phát, hoặc Router của nguồn phát. Mà nó phải được bảo vệ trên toàn bộ các Router tham gia vào cây Măltikest. Bởi vì, nếu một Router trong cây Măltikest bị mất quyền kiểm soát, cho dù hách-cơ không phát tán được thông tin đến tất cả người nhận trong cây Măltikest này, nhưng hách-cơ vẫn có thể chuyển các thông tin giả mạo đến một bộ phận người dùng mà bị chi phối bởi Router. Trong kỹ thuật Măltikest, vùng ảnh hưởng của Router này được gọi là vùng hạ lưu, Down Stream Zone.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659029459546.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/6031010d-5016-442f-884f-c40a69c4910e.mp3","vbee_request_id" : "a8958bc8-40b9-4e0e-ad53-c004487745fb"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Cũng như việc chuyển tiếp các gói tin ai-pi unikest là dựa vào bảng Rao-ting tại các Router, kỹ thuật Măltikest cũng được xử lý tại các Router, dựa vào cơ chế Măltikest Rao-ting.
Việc đảm bảo an toàn cho cây Măltikest được triển khai ngay tại từng Router của cây. Ý tưởng là áp dụng các luật như tường lửa Firewall để lọc các nguồn phát được phép gửi gói tin vào cây Măltikest. Có hai phương án xây dựng luật đảm bảo an toàn cho cây Măltikest . Phương án thứ nhất, là mặc định cây Măltikest cấm tất cả các nguồn phát, và chỉ cho phép các nguồn phát được xác định theo một danh sách. Phương án thứ hai, là mặc định cho phép tất cả các nguồn phát được gửi dữ liệu vào cây Măltikest, trừ các nguồn phát được liệt kê trong danh sách nào đó.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659030142003.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/dff2c61c-91cf-47c8-92fa-2db893eb5bbc.mp3","vbee_request_id" : "06593915-ed35-4656-a182-fd41e6ff98a3"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}, { "ActionGroup" : "#APP", "Action" : "Đóng POWERPOINT", "ActionPara" : "", "Delay" : 0}], "text" : "", "audio_file" : "","vbee_audio_url" : "","vbee_request_id" : ""}] }