{ "vbee_Authorization" : "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpYXQiOjE2NTgxMzMwMjl9.mXlTv4WfK9C1rUFcUUgxfx_1QYjZg7UHrhM0FpOeVkc", "vbee_app_id" : "985eefdc-3a15-4949-a803-8979172fc6ca", "vbee_callback_url" : "http://daotao.ai:8080/vbee/api", "vbee_voice_code" : "hn_male_manhdung_news_48k-fhg", "vbee_speed_rate" : 0.9, "scenario" : [{"presentation_action" : [{ "ActionGroup" : "#APP", "Action" : "Mở POWERPOINT", "ActionPara" : "D:\\Hoang\\Dropbox\\02. SoICT\\02. Đào tạo\\02. Giáo trình\\IT4651 - Thiết kế mạng IP\\Thiết kế mạng IP_Chương 4_Multicast.pptx", "Delay" : 2000}, { "ActionGroup" : "#KEY", "Action" : "PgDn", "ActionPara" : "", "Delay" : 500}, { "ActionGroup" : "#KEY", "Action" : "PgDn", "ActionPara" : "", "Delay" : 500}, { "ActionGroup" : "#KEY", "Action" : "Shift-F5", "ActionPara" : "", "Delay" : 1000}], "text" : "Ta đã quen thuộc với mô hình truyền tin unicast, trong đó có một trạm truyền tin đến cho một trạm nhận tin. Bài toán multicast đặt ra khi cùng một nội dung thông tin, cùng một thời điểm mà một trạm truyền tin và nhiều trạm muốn nhận tin. Ví dụ phổ biến hiện nay như các buổi hội thảo tryền hình, các lớp học online trực tuyến, hay hệ thống truyền hình Internet.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1658999460455.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/e5ccfe43-a300-4cd3-98a4-3ef0a2d7e522.mp3","vbee_request_id" : "1cc3180d-f964-4577-97c1-0def14c021fc"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Tìm hiểu sâu hơn quá trình truyền tin trong ví dụ lớp học online trực tuyến. Máy tính của giáo viên, trong trường hợp này là trạm Host, lấy dữ liệu từ thiết bị camera và micro để truyền đến các máy tính của người học. Các dữ liệu multimedia này được đóng gói và di chuyển trên đường truyền từ Host, qua các router trung gian và đi đến trạm nhận.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1658999329583.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/ca257212-7572-476c-ae63-f94fa853421f.mp3","vbee_request_id" : "057b168b-17f2-494d-a9b7-a5420296d71b"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Bây giờ xuất hiện người học thứ hai tham gia vào lớp học. Một dòng các gói tin được tạo thêm ra để di chuyển từ máy Host đến máy số hai, đi qua các router trung gian. Một cách ngẫu nhiên tùy theo cấu trúc mạng lõi kết nối các router mà dòng gói tin số 1 và dòng gói tin số 2 bị trùng nhau ở một số điểm trung gian, là các router và đường truyền.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1658927449312.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/27/33653abf-8e6e-4ce6-94a7-b34eb89eefad.mp3","vbee_request_id" : "939aeb19-40fc-4f25-bb88-34d6bd2e70ca"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Tiếp tục xuất hiện người học thứ ba tham gia vào lớp học. Một dòng gói tin mới lại được tạo ra để di chuyển từ máy Host đến máy số ba và ngẫu nhiên lại trùng một phần đường truyền với các dòng dữ liệu số một và số hai.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1658927501416.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/27/aaa53db4-4ace-4888-8457-e0367b85dbe9.mp3","vbee_request_id" : "96470ea8-8084-4526-9e34-8535767279b4"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Enter", "ActionPara" : "", "Delay" : 200}], "text" : "Việc trùng các dòng dữ liệu gói tin multimedia trên các kênh truyền và các router như vậy sẽ tạo ra hiện tượng quá tải. Càng nhiều người học tham gia vào lớp học, việc quá tải trên đường truyền và router càng trầm trọng. 
Điểm lưu ý ở đây là các dòng dữ liệu đồng thời này giống hệt nhau về nội dung, nên tạo ra tình huống lãng phí tài nguyên đường truyền. Giống như một nhân viên văn thư cần gửi thông báo đến cho nhiều người ở cùng một địa phương. Thay vì gửi một tờ thông báo đến địa phương đó rồi photocopy ra nhiều bản, cô ấy lại photocopy ngay thành hàng nghìn bản và thuê nhiều xe hàng để chuyển đi.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659005792892.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/668eab81-aade-4063-850f-04c96b043b98.mp3","vbee_request_id" : "48b347e0-6d8b-4da3-b5a3-869a23118b47"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Bây giờ ta sẽ xem kỹ thuật multicast sẽ xử lý vấn đề lãng phí đường truyền này như thế nào. Xuất phát từ dòng gói tin multimedia thứ nhất, các gói tin được các router tìm đường theo địa chỉ trạm nhận, và được chuyển tiếp lần lượt qua các router tiếp theo trên đường truyền cho đến khi cập bến ở trạm nhận. 
So sánh với kỹ thuật unicast, các router hoạt động ở chế độ chuyển tiếp rồi quên. Tức là các gói tin sau khi được tìm đường và chuyển tiếp sang router tiếp theo (gọi là next hop) thì router sẽ không còn nhớ gì đến gói tin này nữa. Trong trường hợp multicast, các router phải ghi nhớ thông tin của từng dòng dữ liệu multicast này để phục vụ cho các yêu cầu về sau.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659001927315.mp3","vbee_audio_url" : "","vbee_request_id" : ""},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Quay trở lại lớp học online, trong khi trạm Host đang truyền dòng multimedia từ camera của giáo viên đến máy tính người học thứ nhất, xuất hiện người học thứ hai muốn tham gia lớp học. Bằng một cách nào đó, hệ thống xác định được dòng gói tin multimedia này có thể được trích xuất từ một router đang tham gia vào phiên chuyển tiếp multicast hiện tại. Kết quả là thay vì phải gửi các gói tin lặp lại từ trạm Host, dòng gói tin multicast được router này nhân bản và chuyển tiếp đến các router trung gian để cập bến máy tính của người học thứ hai.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659009889863.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/f86a3407-8d22-462d-85a6-f7896b81c5ef.mp3","vbee_request_id" : "39c0b28c-a2d2-45a4-a0ac-3f80b653af35"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Cũng như vậy, người học thứ ba muốn tham gia lớp học. Một router đang tham gia vào phiên multicast được xác định và nhân bản dòng gói tin multicast này để chuyển tiếp đến trạm nhận.
Kết quả là tất cả người học trong lớp đều nhận được đầy đủ dữ liệu gửi từ giáo viên, giống như trong phiên unicast. Nhưng điểm khác biệt là trên các đường truyền và router trung gian không xuất hiện tình trạng lặp các gói tin có nội dung giống nhau dẫn tới quá tải hệ thống.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659010002608.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/e60b0a5c-a964-45b2-becf-bf0969e24b6a.mp3","vbee_request_id" : "a455d58d-e27a-418c-aae3-35c344b99c17"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Giải pháp multicast mang đến cơ hội tuyệt vời để triển khai các ứng dụng Internet multimedia hiệu quả. Ví dụ như truyền hình Internet xuất hiện và đang dần loại bỏ các hệ thống truyền hình kỹ thuật cũ. Tuy nhiên, nó cũng tạo ra vấn đề an toàn thông tin mới mà unicast không có. Vùng multicast, hay còn gọi là cây multicast, được tạo nên bằng cách ghép nối các router trong mỗi phiên multicast phải được đảm bảo an toàn.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659007844820.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/6aac3919-4896-4b48-9f0a-af37457bee08.mp3","vbee_request_id" : "9eb4b10e-214e-451a-bc02-007c1b5eca10"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Bạn hãy hình dung điều gì sẽ xảy ra nếu nguồn phát, hoặc router tại nguồn phát bị hacker chiếm quyền kiểm soát? nếu đó là router đang tham gia vào phiên truyền hình của VTV1, một bản tin của hacker có thể được phát tán đến toàn bộ người xem truyền hình Việt Nam, và nguy hiểm hơn nữa, là nó được phát đi trên hệ thống truyền hình quốc gia. Có nghĩa là một bản tin giả mạo được phát đi khắp đất nước và người dân hoàn toàn yên tâm đó là tin chính thức của chính phủ.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659010252629.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/43e39ed0-5017-45e4-97a9-9452beddab74.mp3","vbee_request_id" : "479bb2f0-cfac-41cd-9057-e0a7924805d8"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Lưu ý rằng, việc bảo vệ an toàn cho cây multicast không chỉ phải được thực hiện ở nguồn phát, hoặc router của nguồn phát. Mà nó phải được bảo vệ trên toàn bộ các router tham gia vào cây multicast. Bởi vì, nếu một router trong cây multicast bị mất quyền kiểm soát, cho dù hacker không phát tán được thông tin đến tất cả người nhận trong cây multicast này, nhưng hacker vẫn có thể chuyển các thông tin giả mạo đến một bộ phận người dùng mà bị chi phối bởi router. Trong kỹ thuật multicast, vùng ảnh hưởng của router này được gọi là vùng hạ lưu. Tiếng anh là down stream zone.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659010673078.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/dc654298-2226-417d-aefc-0466ef595bc8.mp3","vbee_request_id" : "441c8153-7180-4903-8e2d-b40a1ed1e5a0"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}], "text" : "Cũng như việc chuyển tiếp các gói tin IP unicast, dựa vào bảng routing tại các router, kỹ thuật multicast dựa vào xử lý tại các router, và được gọi là multicast routing.
Việc đảm bảo an toàn cho cây multicast được triển khai trong từng router khi xây dựng cây multicast. Ý tưởng là áp dụng các luật như tường lửa firewall để lọc các nguồn phát có thể gửi gói tin vào cây multicast. Có hai phương án xây dựng luật đảm bảo an toàn cho cây multicast. Phương án thứ nhất là, mặc định cây multicast cấm tất cả các nguồn phát, và chỉ cho phép các nguồn phát, được xác định trong danh sách. Phương án này gọi là, none but include. Phương án thứ hai là, mặc định cho phép tất cả các nguồn phát được gửi dữ liệu vào cây multicast, TRỪ các nguồn phát được liệt kê trong danh sách. Phương án này gọi là, all but exclude.", "audio_file" : "D:/working/git/AuthTool/data/Multicast/1659011914540.mp3","vbee_audio_url" : "https://vbee-studio-30.s3.ap-southeast-1.amazonaws.com/synthesis/2022/07/28/d5113d07-e77a-4cfa-9117-14dd29de37bd.mp3","vbee_request_id" : "b6b8966e-ff9e-47b8-81b3-d7ad3f17ccd6"},{"presentation_action" : [{ "ActionGroup" : "#KEY", "Action" : "Right", "ActionPara" : "", "Delay" : 200}, { "ActionGroup" : "#APP", "Action" : "Đóng POWERPOINT", "ActionPara" : "", "Delay" : 0}], "text" : "", "audio_file" : "","vbee_audio_url" : "","vbee_request_id" : ""}] }